// وفريسلا ةبتكم نيمضت 
#include <Servo.h> 
 
// نئاك ءاشنإ (object) عون نم Servo 
// وفريس نم رثكأ كيدل ناك اذإ تانئاك ةدع ءاشنإ كنكمي 
Servo myServo; 
 
// وفريسلا ةراشإ كلس هب لصتيس يذلا يمقرلا فرطلا فيرعت 
const int servoPin = 9; 
 
void setup() { 
  // ددحملا فرطلاب وفريسلا نئاك قافرإ 
  //  فرطلا نأ ونيودرلأا ربخي اذه 9 وفريسلا يف مكحتيس 
  myServo.attach(servoPin); 
} 
 
void loop() { 
  //  ىلإ وفريسلا كيرحت 0 ةجرد 
  myServo.write(0); 
  delay(1000); // ةدحاو ةيناث ةدمل راظتنلاا 
 
  //  ىلإ وفريسلا كيرحت 90 ةجرد 
  myServo.write(90); 
  delay(1000); // ةدحاو ةيناث ةدمل راظتنلاا 
 
  //  ىلإ وفريسلا كيرحت 180 ةجرد 
  myServo.write(180); 
  delay(1000); // ةدحاو ةيناث ةدمل راظتنلاا 
}