// تعريف الطرف المتصل بمكبر الصوت
const int speakerPin = 9; 
 
void setup() { 
  //لا نحتاج لتعريف الطرف كمخرج بشكل صريح عند استخدام دالة tune()
  //ولكن من الجيد معرفة ان الدالة تتعامل مع الطرف كمخرج
} 
 
void loop() { 
  //  تشغيل نغمة بتردد 440 هرتز لمدة 500 مللي ثانية 
  tone(speakerPin, 440); 
  delay(500); 
 
  // ايقاف النغمة
  noTone(speakerPin); 
  delay(500); 
 
  //  تشغيل نغمة بتردد 523 هرتز لمدة 500 مللي ثانية 
  tone(speakerPin, 523); 
  delay(500); 
 
  // ايقاف النغمة
  noTone(speakerPin); 
  delay(500); 
 
  //  تشغيل نغمة بتردد 659 هرتز لمدة 500 مللي ثانية 
  tone(speakerPin, 659); 
  delay(500); 
 
  // ايقاف النغمة
  noTone(speakerPin); 
  delay(1000); // تاخير اطول قبل تكرار اللحن 
}